Revit 2024 API
ShellLayerType Enumeration
 Used to distinguish exterior and interior shell layers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum ShellLayerType
Visual Basic
Public Enumeration ShellLayerType
Visual C++
public enum class ShellLayerType
Members
Member name | Description
Interior |  Interior shell layer.
Exterior |  Exterior shell layer.
Remarks
 Used as an argument to methods of CompoundStructure that deal with shell layers.
See Also
Autodesk.Revit.DB Namespace